In [1]:
from shapely.geometry import Point
import pandas as pd
import geopandas as gpd
import matplotlib.pyplot as plt
import folium
from folium.plugins import MarkerCluster
from folium.plugins import FastMarkerCluster

In [2]:
from sqlalchemy import create_engine, text

In [3]:
database_name = 'nashville_scooters'

connection_string = f"postgresql://postgres:postgres@localhost:5432/nashville_scooters"

In [4]:
engine = create_engine(connection_string)

#### Filtering Specific Columns Needed

In [5]:
query = '''
SELECT DISTINCT starttime, endtime, startdate, enddate
FROM trips;
'''

with engine.connect() as connection: result = connection.execute(text(query))

In [6]:
with engine.connect() as connection:
    starttime = pd.read_sql(text(query), con = connection)

#### Sorting Startime Column Least to Greatest

In [7]:
starttime.sort_values(by = 'starttime', ascending = True)

              starttime          endtime   startdate     enddate
258930         00:00:00         00:08:02  2019-07-04  2019-07-04
522542         00:00:00         00:05:53  2019-07-17  2019-07-17
397111         00:00:00         00:34:27  2019-06-16  2019-06-16
286546         00:00:00         00:24:20  2019-06-25  2019-06-25
444923         00:00:00         00:13:39  2019-05-18  2019-05-18
...                 ...              ...         ...         ...
295375         23:59:59         00:11:44  2019-06-21  2019-06-22
192752         23:59:59         00:01:16  2019-05-22  2019-05-23
304441  23:59:59.056666  00:08:00.943333  2019-06-01  2019-06-02
155107  23:59:59.286666  00:04:34.840000  2019-07-09  2019-07-10
185265  23:59:59.506666  00:17:46.773333  2019-06-06  2019-06-07

[530772 rows x 4 columns]

In [8]:
query = '''
SELECT MIN(starttime), MAX(starttime)
FROM trips;
'''

with engine.connect() as connection: result = connection.execute(text(query))

In [9]:
with engine.connect() as connection:
    starttime = pd.read_sql(text(query), con = connection)

In [10]:
starttime

        min              max
0  00:00:00  23:59:59.506666

#### Sorting To Get days Available For Scooters

In [11]:
query = '''
SELECT DISTINCT startdate, enddate, sumdid
FROM trips;
'''

with engine.connect() as connection: result = connection.execute(text(query))

In [12]:
with engine.connect() as connection:
    date_available = pd.read_sql(text(query), con = connection)

In [13]:
date_available.sort_values(by = 'startdate' and 'enddate', ascending = True)

         startdate     enddate                sumdid
31526   2019-05-01  2019-05-01          PoweredT35IN
17400   2019-05-01  2019-05-01          PoweredR2YNT
19589   2019-05-01  2019-05-01  Powered5534BHQRBTGDT
14417   2019-05-01  2019-05-01  Powered5PNICU2MRR3QU
28672   2019-05-01  2019-05-01          PoweredZSENL
...            ...         ...                   ...
150259  2019-07-31  2019-08-01         Powered382538
62332   2019-07-31  2019-08-01         Powered171208
142962  2019-07-31  2019-08-01         Powered511914
127450  2019-07-31  2019-08-01          PoweredV152F
127552  2019-07-31  2019-08-01         Powered599718

[210460 rows x 3 columns]

In [24]:
date_available.head()

    startdate     enddate                sumdid
0  2019-05-10  2019-05-10  PoweredVVG574IZJLNTB
1  2019-05-04  2019-05-04          PoweredG4BDM
2  2019-05-20  2019-05-20        Powered3376589
3  2019-05-11  2019-05-11         Powered874955
4  2019-05-06  2019-05-06          Powered5DHJ9

In [14]:
type(date_available)

pandas.core.frame.DataFrame

#### Merge In Scooters Table For Type(Scooters)

In [15]:
query = '''
SELECT DISTINCT sumdgroup, sumdid
FROM scooters;
'''

with engine.connect() as connection: result = connection.execute(text(query))

In [19]:
with engine.connect() as connection:
    scooter_type = pd.read_sql(text(query), con = connection)
scooter_type

      sumdgroup                 sumdid
0       bicycle  Standard2UGJKREVB53HT
1       bicycle  Standard5JXOV277MCWID
2       bicycle  StandardNPOOZNUSGAXZN
3       bicycle  StandardNUTLLXP4G37OI
4       bicycle  StandardNW5HJFO4R32LY
...         ...                    ...
10013   Scooter         Powered9928227
10014   Scooter         Powered9939396
10015   Scooter         Powered9950370
10016   Scooter         Powered9958429
10017   Scooter         Powered9963670

[10018 rows x 2 columns]

In [27]:
merged_df = pd.merge(date_available, scooter_type, 
                    on= 'sumdid', how = 'inner')
merged_df

         startdate     enddate                sumdid sumdgroup
0       2019-05-10  2019-05-10  PoweredVVG574IZJLNTB   scooter
1       2019-05-11  2019-05-11  PoweredVVG574IZJLNTB   scooter
2       2019-05-25  2019-05-25  PoweredVVG574IZJLNTB   scooter
3       2019-05-12  2019-05-12  PoweredVVG574IZJLNTB   scooter
4       2019-05-13  2019-05-13  PoweredVVG574IZJLNTB   scooter
...            ...         ...                   ...       ...
210239  2019-06-29  2019-06-29          PoweredU9BZ5   scooter
210240  2019-06-26  2019-06-26  PoweredNW7CIMULITUAA   scooter
210241  2019-07-30  2019-07-30         Powered586203   scooter
210242  2019-07-28  2019-07-28          PoweredHHAZW   scooter
210243  2019-07-27  2019-07-27         Powered094941   scooter

[210244 rows x 4 columns]